	//UI Messages
"#Title#" =  "Lazy Hackintosh Image Generator";
"#Debug On#" = "Enable debug logging";
"#Debug Off#" = "Disable debug logging";
"#Input is void#" =  "Image didn't set!";
"#Custom Size#" = "Custom Image Size";

"#Output Title#" = "output selection";
"#Output Msg#" = "please designate a output";

"#Image Title#" = "input file selection";
"#Image Msg#" = "please select Installer Image or app, file extension must be dmg or app";

"#Extra Title#" = "Extra folder selection";
"#Extra Msg#" = "please select your extra folder, file name must be extra";

"#OSInstaller Title#" = "OSInstaller selection";
"#OSInstaller Msg#" = "please select your patched OSInstaller, file name must be OSInstaller";
	//Warning Messages
"#WRONGSIZE#" = "Sorry, your input size exceeds the maximum size limitation.";
"#Failed Lapic#" = "Lapic patch failed, counldn't determine system version.";
	//Eroor Messages
"#Error in InstallESD image#" =  "ERROR: Couldn't find the mount point of Install ESD.";
"#Error in lazy image#" =  "ERROR: Couldn't write to the output image.";
"#Error in sysVer#" = "System Version obtain failed,you may have a corrupted image";
"#Asr Timeout#" = "asr process timed out, please check your cpu and memory usage";
	//Progress Messages
"#CleanDir#" = "Cleaning and creating temporary directory...";
"#Create CDR#" = "Generating CDR...";
"#MOUNTORG#" =  "Mounting image...";
"#MOUNTESD#" =  "Mounting InstallESD image...";
"#Create Lazy image#" =  "Creating image... Please wait.";
"#Mount Lazy image#" =  "Mounting created image...";
"#COPYBASE#" =  "Copying BaseSystem file...";
"#Wait Asr#" = "Waiting for asr command to finish";
"#Copy ESD#" =  "Copying InstallESD file...";
"#DELETEPACKAGE#" =  "Deleting Package folder's alias...";
"#COPYPACKAGE#" =  "Copying Packages folder to /System/Installation... It will take a long time.";
"#Create Kernels folder#" =  "Creating Kernels folder...";
"#Patch osinstaller#" =  "Patching OSInstaller";
"#Patch osinstall.mpkg#" =  "Patching OSInstall.mpkg";
"#COPYKERNELF#" =  "Copying kernel...";
"#XCPMPATCH#" =  "Patching XCPM";
"#COPYEXTRA#" =  "Copying Extra folder";
"#EJECTBASE#" =  "Unmounting BaseSystem";
"#EJECTESD#" =  "Unmounting . . ";
"#EJECTORG#" =  "Unmounting . . .";
"#EJECTLAZY#" =  "Unmounting .";
"#Finishing#" = "process finished,removing temporary directory";
"#FINISH#" = "Done!";
"#MV#" = "Moving files to desktop";
"#LAPICPATCH#" = "Patching Lapic";
